{
    "bestProjects": [
        {
            "id": "1",
            "title": "Space X",
            "description": "Vejá as estásticas as de lançamentos da SpaceX",
            "image": "/assets/ProjectSpaceX.png",
            "techs": [
                { 
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
                },
                {
                    "name": "Tailwind",
                    "image": "/icons/tailwind.svg"
                },
                {
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"   
                },
                {
                    "name": "PrismaJs",
                    "image": "/icons/prisma.svg"
                }
            ],
            "data": "2025-01-05T00:00:00-03:00",
            "link": "https://space-x-app-two.vercel.app/"
        },
        {
            "id": "2",
            "title": "Move",
            "description": "A rede social de atividades físicas onde você pode criar grupos e verificar sua média de horas de atividades realizadas.",
            "image": "/assets/ProjectMove.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
                }, 
                {
                    "name": "NestJs",
                    "image": "/icons/nestjs.svg"
                },
                {
                    "name": "PrismaJs",
                    "image": "/icons/prisma.svg"
                }
            ],
            "data": "2024-11-29T00:00:00-03:00",
            "link": "move-frontend-azure.vercel.app"
        },
        {
            "id": "3",
            "title": "Sem Calote",
            "description": "Gerencie as cobranças de seus clientes em um único site",
            "image": "/assets/ProjectSemCalote.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "javascript",
                    "image": "/icons/javascript.svg"
                },
                {
                    "name": "Knex",
                    "image": "/icons/knexjs.svg"
                }
            ],
            "data": "2023-10-10T00:00:00-03:00",
            "link": "https://example.com/project3"
        }
    ],
    "projects": [
        {
            "id": "1",
            "title": "Space X",
            "role": "Full Stack",
            "descriptionDetail": "O site SpaceX foi criado como parte de um desafio técnico, com o objetivo de demonstrar minha capacidade de desenvolver uma aplicação do zero e aprimorá-la continuamente. Uma das melhorias implementadas foi a criação de um cron job, que reduz o consumo excessivo da API pública da SpaceX, garantindo eficiência e otimização de recursos.\n\nA aplicação foi desenvolvida utilizando React com o framework Vite, permitindo um fluxo de trabalho ágil. Para facilitar a criação e personalização de componentes, utilizei o shadcn, que possibilita desenvolver componentes base e ajustá-los conforme o layout. Além disso, usei o React Query para consumir uma API externa criada por mim, trazendo eficiência ao gerenciamento de dados na aplicação.\n\nO backend foi desenvolvido com Express, estruturado de forma modular para permitir futuras melhorias, como a substituição pelo Fastify para maior desempenho e suporte mais robusto a atualizações. Também implementei testes end-to-end (E2E) para garantir a funcionalidade e a qualidade do sistema. Esses testes foram automatizados com GitHub Actions, configurando scripts para rodar verificações automaticamente em cada push e pull request.\n\nAlém disso, criei um cron job que atualiza o banco de dados diariamente às 9 da manhã, garantindo que as informações estejam sempre atualizadas e prontas para uso.\n\nPor fim, integrei o Swagger à API, fornecendo uma documentação detalhada que facilita revisões, manutenção e futuras melhorias no projeto.",
            "github": "https://github.com/Amandalfs/SpaceX_app",
            "demo": "https://space-x-app-two.vercel.app/",
            "team": null,
            "isSolo": true,
            "image": "/assets/ProjectSpaceX.png",
            "techs": [
                { 
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
                },
                {
                    "name": "Tailwind",
                    "image": "/icons/tailwind.svg"
                },
                {
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                }
            ],
            "date": "2025-01-05T00:00:00-03:00"
        },
        {
            "id": "2",
            "title": "Move",
            "role": "Full Stack",
            "github": "https://github.com/Move-HandsOn/",
            "demo": "https://move-frontend-azure.vercel.app/",
            "descriptionDetail": "O Move é uma rede social focada em atividades físicas, permitindo que os usuários compartilhem suas práticas, entrem em grupos existentes ou criem seus próprios grupos para discussões específicas ou organização de eventos.\n\nO site oferece diversas funcionalidades para gerenciar atividades e eventos, incluindo:\n- **Agenda personalizada:** permite visualizar os eventos agendados para um dia específico.\n- **Perfil do usuário:** exibe um gráfico de colunas com o total de horas de atividades físicas realizadas, notificações de curtidas, seguidores, interações em comentários e uma lista completa de publicações.\n\nMinha responsabilidade no projeto incluiu:\n- Desenvolver os componentes de formulários do site.\n- Criar toda a lógica de gerenciamento da agenda do usuário, proporcionando a melhor experiência possível.\n- Implementar a integração do feed com uma API que fornece informações como nome de usuário, publicações, e um carrossel de grupos.\n\nEsse projeto foi concluído com sucesso graças à excelente comunicação e organização da equipe. Todos os membros eram responsáveis por suas tarefas e mantinham o time atualizado sobre qualquer imprevisto. Além disso, o suporte constante do time de UX/UI garantiu clareza nas regras de negócio e nas interfaces.",
            "team":  [
                {
                    "name": "Amanda Oliveira",
                    "role": "Back End"
                },
                {
                    "name": "Isabella Brito",
                    "role": "Front End"
                },
                {
                    "name": "Adrian",
                    "role": "UX/UI"
                },
                {
                    "name": "Thalita",
                    "role": "UX/UI"
                },
                {
                    "name": "Éli",
                    "role": "UX/UI"
                },
                {
                    "name": "Samara",
                    "role": "UX/UI"
                }
            ],
            "isSolo": false,
            "image": "/assets/ProjectMove.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
        }

            ],
            "date": "2024-11-29T00:00:00-03:00"
        },
        {
            "id": "3",
            "title": "Sem calote",
            "role": "Full Stack",
            "github": "https://github.com/LuizLimaDev/front-back-mountain-frontend",
            "demo": "https://front-back-mountain-frontend.vercel.app",
            "descriptionDetail": "O site Sem Calote foi o último projeto que desenvolvi durante o curso da Cubos Academy. O objetivo do projeto era permitir que trabalhássemos em equipe para criar um site funcional e colaborativo.\n\nMinha principal responsabilidade foi dar suporte aos meus colegas no backend, ajudando no desenvolvimento das tabelas do banco de dados e na implementação de funcionalidades tanto no backend quanto no frontend.\n\nO projeto foi dividido em três sprints, e nossa equipe conseguiu entregar todas as tarefas de cada sprint com sucesso. Durante as sprints, aprendi a trabalhar melhor em equipe e a me comunicar de forma eficaz para alinhar pensamentos e estratégias com todos os membros do time.\n\nAlém disso, realizei algumas manutenções no deploy do backend para manter o projeto ativo, verificando o banco de dados e a funcionalidade geral da aplicação. Como tínhamos tempo disponível, também implementamos o Swagger para documentar todas as rotas, facilitando revisões e futuras melhorias.",
            "team": [
                {
                    "name": "Eduardo Alcântara",
                    "role": "Front End"
                },
                {
                    "name": "Fernanda Campelo",
                    "role": "Full Stack"
                }, 
                {
                    "name": "Luiz Lima",
                    "role": "Full Stack"
                },
                {
                    "name": "Igor Beserra",
                    "role":"Front End"
                }
            ]
            ,
            "isSolo": false,
            "image": "/assets/ProjectSemCalote.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "javascript",
                    "image": "/icons/javascript.svg"
                },
                {   
                    "name": "Knex",
                    "image": "/icons/knexjs.svg"
                }
            ],
            "date": "2023-10-10T00:00:00-03:00"
        }

    ]
}