{
    "bestProjects": [
        {
            "id": "1",
            "title": "Space X",
            "description": "Check the statistics of SpaceX launches",
            "image": "/assets/ProjectSpaceX.png",
            "techs": [
                { 
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
                },
                {
                    "name": "Tailwind",
                    "image": "/icons/tailwind.svg"
                },
                {
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"   
                },
                {
                    "name": "PrismaJs",
                    "image": "/icons/prisma.svg"
                }
            ],
            "data": "2025-01-05T00:00:00-03:00",
            "link": "https://space-x-app-two.vercel.app/"
        },
        {
            "id": "2",
            "title": "Move",
            "description": "The social network for physical activities where you can create groups and check your average hours of activities performed.",
            "image": "/assets/ProjectMove.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
                }, 
                {
                    "name": "NestJs",
                    "image": "/icons/nestjs.svg"
                },
                {
                    "name": "PrismaJs",
                    "image": "/icons/prisma.svg"
                }
            ],
            "data": "2024-11-29T00:00:00-03:00",
            "link": "move-frontend-azure.vercel.app"
        },
        {
            "id": "3",
            "title": "Sem calote",
            "description": "Manage your clients' charges on a single website",
            "image": "/assets/ProjectSemCalote.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "javascript",
                    "image": "/icons/javascript.svg"
                },
                {
                    "name": "Knex",
                    "image": "/icons/knexjs.svg"
                }
            ],
            "data": "2023-10-10T00:00:00-03:00",
            "link": "https://example.com/project3"
        }
    ],
    "projects": [
        {
            "id": "1",
            "title": "Space X",
            "role": "Full Stack",
            "description-detail": "The SpaceX website was created as part of a technical challenge, aimed at demonstrating my ability to develop an application from scratch and continuously enhance it. One of the implemented improvements was the creation of a cron job to reduce excessive consumption of the public SpaceX API, ensuring efficiency and resource optimization.\n\nThe application was developed using React with the Vite framework, enabling a faster development workflow. To streamline the creation and customization of components, I utilized shadcn, which allows for the development of base components that can be tailored to fit the layout. Additionally, I used React Query to consume an external API that I built, ensuring efficient data management within the application.\n\nThe backend was developed with Express, structured modularly to allow for future improvements, such as replacing it with Fastify for better performance and more robust update support. I also implemented end-to-end (E2E) tests to ensure the functionality and quality of the system. These tests were automated using GitHub Actions, configuring scripts to run verifications automatically on every push and pull request.\n\nMoreover, I created a cron job to update the database daily at 9 AM, ensuring that the information is always up-to-date and ready for use.\n\nFinally, I integrated Swagger into the API, providing detailed documentation to facilitate reviews, maintenance, and future improvements to the project.",
            "github": "https://github.com/Amandalfs/SpaceX_app",
            "demo": "https://space-x-app-two.vercel.app/",
            "team": null,
            "isSolo": true,
            "image": "/assets/ProjectSpaceX.png",
            "techs": [
                { 
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
                },
                {
                    "name": "Tailwind",
                    "image": "/icons/tailwind.svg"
                },
                {
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                }
            ],
            "date": "2025-01-05T00:00:00-03:00"
        },
        {
            "id": "2",
            "title": "Move",
            "role": "Full Stack",
            "github": "https://github.com/Move-HandsOn/",
            "demo": "https://move-frontend-azure.vercel.app/",
            "description-detail": "Move is a social network focused on physical activities, where users can see others engaging in activities, join existing groups, or create their own groups for specific posts or organizing group events.\n\nThe platform offers several features to manage activities and events, such as:\n- **Personalized schedule:** allows users to view events scheduled for a selected day.\n- **User profile:** displays a bar chart with data such as hours of physical activities completed, total accumulated hours, notifications of likes, new followers, comment interactions, and a list of all user posts.\n\nMy responsibilities in the project included:\n- Developing the form components for the site.\n- Implementing the logic for managing the user's schedule to ensure the best possible user experience.\n- Working on the feed integration and rendering, using an API that provided information such as user names, posts, and a group carousel.\n\n**Technologies used:**\nIn the frontend, we used **React** with the **Vite** framework. The forms were developed using **Material UI**, **React Hook Form**, and validations with **Zod**. For caching and to facilitate API consumption and data updates, we used **TanStack Query (React Query)**.\nIn the backend, we opted for **NestJS** with **Prisma** to simplify API development. The database was managed with **Supabase**, offering a cost-effective solution with support for PostgreSQL and file uploads.\n\nThis project was successfully completed thanks to excellent communication and organization within the team. Each member was responsible for their tasks and kept the team updated on any issues. Additionally, the UX/UI team provided essential support in defining business rules and creating effective interfaces.",
            "team":  [
                {
                    "name": "Amanda Oliveira",
                    "role": "Back End"
                },
                {
                    "name": "Isabella Brito",
                    "role": "Front End"
                },
                {
                    "name": "Adrian",
                    "role": "UX/UI"
                },
                {
                    "name": "Thalita",
                    "role": "UX/UI"
                },
                {
                    "name": "Éli",
                    "role": "UX/UI"
                },
                {
                    "name": "Samara",
                    "role": "UX/UI"
                }
            ],
            "isSolo": false,
            "image": "/assets/ProjectMove.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "Typescript",
                    "image": "/icons/typescript.svg"
        }

            ],
            "date": "2024-11-29T00:00:00-03:00"
        },
        {
            "id": "3",
            "title": "Sem calote",
            "role": "Full Stack",
            "github": "https://github.com/LuizLimaDev/front-back-mountain-frontend",
            "demo": "https://front-back-mountain-frontend.vercel.app",
            "description-detail": "The Sem Calote website was the final project I worked on during the Cubos Academy course. The goal of the project was to allow us to collaborate as a team to build a functional and cohesive website.\n\nMy main responsibility was to support my colleagues on the backend, assisting in the development of database tables and implementing features on both the backend and frontend.\n\nThe project was divided into three sprints, and our team successfully delivered all tasks for each sprint. During the sprints, I learned how to collaborate more effectively and communicate properly to ensure everyone was aligned with the same vision and strategy.\n\nAdditionally, I performed maintenance on the backend deployment to keep the project running smoothly, including database checks and ensuring overall functionality. Since we had extra time, we also implemented Swagger to document all routes, making reviews and future improvements easier.",
            "team": [
                {
                    "name": "Eduardo Alcântara",
                    "role": "Front End"
                },
                {
                    "name": "Fernanda Campelo",
                    "role": "Full Stack"
                }, 
                {
                    "name": "Luiz Lima",
                    "role": "Full Stack"
                },
                {
                    "name": "Igor Beserra",
                    "role":"Front End"
                }
            ]
            ,
            "isSolo": false,
            "image": "/assets/ProjectSemCalote.png",
            "techs": [
                { 
                    "name": "Node.js",
                    "image": "/icons/nodejs.svg"
                },
                {
                    "name": "ReactJs",
                    "image": "/icons/react.svg"
                },
                {
                    "name": "javascript",
                    "image": "/icons/javascript.svg"
                },
                {   
                    "name": "Knex",
                    "image": "/icons/knexjs.svg"
                }
            ],
            "date": "2023-10-10T00:00:00-03:00"
        }

    ]
}
